{
  "stories": [
    {
      "id": "1",
      "title": "How Tiny Tasks Changed My Life",
      "summary": "I used to feel overwhelmed by my endless to-do list. Everything felt urgent, so I did nothing. Then I discovered the power of breaking tasks into the smallest possible steps.",
      "content": "I used to feel overwhelmed by my endless to-do list. Everything felt urgent, so I did nothing. Then I discovered the power of breaking tasks into the smallest possible steps.\n\nAt first, it felt silly to write down things like 'Open laptop' or 'Write one sentence.' But DoneList made it easy to focus on just the next action. Every time I checked off a tiny task, I felt a little spark of motivation.\n\nInstead of dreading big projects, I started to enjoy the process. I realized that progress is made one small step at a time. Now, I use DoneList to break down everything—from work projects to daily chores. My productivity has soared, and my stress has dropped.\n\nIf you're struggling to get started, try making your tasks as small as possible. The satisfaction of checking them off will keep you moving forward!",
      "category": "productivity",
      "date": "2024-08-16"
    },
    {
      "id": "2",
      "title": "From Procrastination to Progress",
      "summary": "Procrastination used to rule my life. I'd put off important things for weeks. DoneList helped me turn things around by making every step feel achievable.",
      "content": "Procrastination used to rule my life. I'd put off important things for weeks. DoneList helped me turn things around by making every step feel achievable.\n\nI read about the 'next action' method and decided to try it. Instead of writing 'Finish report,' I wrote 'Open document,' 'Write one sentence,' 'Save file.'\n\nThe app's minimal design kept me focused. Each time I checked off a step, I felt a sense of accomplishment. The positive feedback loop made me want to keep going.\n\nNow, I'm more consistent and less stressed. My advice: don't be afraid to make your tasks tiny. Progress is progress, no matter how small.",
      "category": "motivation",
      "date": "2024-08-15"
    },
    {
      "id": "3",
      "title": "The Power of Positive Feedback",
      "summary": "I never realized how motivating a simple checkmark could be. DoneList's instant feedback turned my daily routine into a series of small wins.",
      "content": "I never realized how motivating a simple checkmark could be. DoneList's instant feedback turned my daily routine into a series of small wins.\n\nBefore using the app, I'd often feel stuck and unproductive. But when I started breaking my goals into micro-tasks, everything changed.\n\nNow, my list is full of actions like 'Stand up,' 'Drink water,' 'Reply to one email.' Each time I check something off, I feel a little more energized.\n\nThe best part? The momentum builds. Some days, I finish more than I ever thought possible. If you want to beat procrastination, start small and celebrate every win!",
      "category": "habits",
      "date": "2024-08-14"
    },
    {
      "id": "4",
      "title": "A Little Tool for My Brain Dump",
      "summary": "I'd once read that writing a brain dump can ease anxiety when you're feeling overwhelmed.",
      "content": "A friend of mine asked me to test a little app she was working on. We're both champion procrastinators, so of course I said yes.\n\nI'd once read that writing a "brain dump" can ease anxiety when you're feeling overwhelmed. So I started using her Done List for exactly that.\n\nWhenever I felt stressed, I'd just start logging everything I'd done: Got out of bed. Brushed my teeth. Drank a glass of water. Replied to one email... I'd check them off as I went.\n\nIt's surprisingly powerful. Watching that list grow made me realize, "Hey, I am getting things done." The mental weight just started to feel lighter.\n\nSometimes the simplest solutions are the most effective. You just need to see your own progress.",
      "category": "productivity",
      "date": "2024-10-14"
    },
    {
      "id": "5",
      "title": "My 20-Year Struggle with ADHD and the Tool That Saved Me",
      "summary": "I decided to work with my brain, not against it.",
      "content": "I'm the developer behind Done List. For nearly two decades, my life with ADHD was defined by procrastination. Starting tasks felt impossible, and my brain would shut down at any slightly complex goal. I'd often lose interest right after pushing through the hardest part of a project, leaving everything half-finished.\n\nMy academic life was a series of last-minute scrambles. I jumped between jobs, and years after graduating, I was still in entry-level roles. I saw the disappointment in others' eyes, and I felt it in myself. I was convinced I would never accomplish anything.\n\nDiscovering ADHD was my lifeline. For the first time, I had a framework for my struggles. I decided to work with my brain, not against it.\n\nAfter countless attempts, I found what worked: tracking what I'd done. I broke down daunting tasks into "one-second steps" I couldn't refuse—like "open laptop." Every checkmark gave me a small hit of accomplishment. That momentum pushed me to start, and to continue.\n\nI even built this app by breaking it down into hundreds of tiny, manageable tasks.This method has kept me moving forward for seven years. If you see yourself in my story, I hope Done List can be your lifeline, too.",
      "category": "productivity",
      "date": "2024-10-14"
    },
    {
      "id": "6",
      "title": "How I Hack My Motivation",
      "summary": "Why is it easy to binge potato chips, but not to study?",
      "content": "I remember a brilliant Quora question - Why is it easy to binge potato chips, but not to study?\n\nOne answer was instant gratification. Every chip is a tiny reward. With studying, the reward is distant and uncertain.\n\nt got me thinking: could I create instant gratification for the things that matter?\n\nMy sister—the developer of this app—suggested I keep a Done List. She told me that every time you check off a completed task, you're giving yourself a deliberate pat on the back.\n\nSo I tried it.Read 5 pages. Check.Wrote one paragraph. Check.\n\nThose self-administered checkmarks were my "potato chips." They kept me going, creating a chain of small wins until the real-world results finally came.\n\nYou can't always control when the world rewards you, but you can always reward yourself.\n\nNow, my sister has built this simple tool around that very idea. If you're looking for a way to keep going, start here.",
      "category": "motivation",
      "date": "2024-10-14"
    },
  ],
  "lastUpdated": "2024-10-28",
  "version": "1.0"
}
